testCases/T3A/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-8;
        relTol           0.001;
        minIter          5;
        maxIter          100;
        smoother         GaussSeidel;
        nPreSweeps       1;
        nPostSweeps      3;
        nFinestSweeps    3;
        scaleCorrection true; 
        directSolveCoarsest false;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 50;
        agglomerator     faceAreaPair;
        mergeLevels      1;
    }

    "(U|k|omega|gamma)"
    {
      solver           PBiCG;
      preconditioner   DILU;
      tolerance        1e-8;
      relTol           0.001;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;
    
    pRefCell        0;
    pRefValue       0;

    //residualControl
    //{
    //    p               1e-5;
    //    U               1e-5;
    //    "(kt|kl|omega)"     1e-5;
    //}
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
        "(k|omega|gamma)"     0.5;
    }
}

cache
{
    grad(U);
}

// ************************************************************************* //
